Revit 2026 API

# NurbSplineCreateCurve(IListXYZ, IListDouble) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Curve CreateCurve(
	IList<XYZ> controlPoints,
	IList<double> weights
)
```
```vb
Public Shared Function CreateCurve (
	controlPoints As IList(Of XYZ),
	weights As IList(Of Double)
) As Curve
```
```cpp
public:
static Curve^ CreateCurve(
	IList<XYZ^>^ controlPoints,
	IList<double>^ weights
)
```
```fsharp
static member CreateCurve :
        controlPoints : IList<XYZ> *
        weights : IList<float> -> Curve
```

#### Parameters

controlPoints IListXYZ

weights IListDouble

#### Return Value

Curve

#### Reference

NurbSpline Class

CreateCurve Overload

Autodesk.Revit.DB Namespace